feat: use mermaid
